[
  {
    "q": "Mengapa Jepang membentuk BPUPK (Dokuritsu Zyunbi Tyoosakai) pada 29 April 1945?",
    "choices": [
      "Untuk memberi kemerdekaan penuh secepatnya tanpa syarat",
      "Untuk mencari dukungan rakyat Indonesia sambil mengendalikan proses persiapan kemerdekaan",
      "Untuk langsung menyerahkan kedaulatan ke PPKI",
      "Untuk melatih administrasi sipil Indonesia saja",
      "Untuk mengadakan konferensi ekonomi Asia"
    ],
    "answer": 1
  },
  {
    "q": "Salah satu alasan gagasan Soekarno tentang Pancasila diterima secara aklamasi di BPUPK adalah karena...",
    "choices": [
      "pidatonya sangat singkat dan diskrit",
      "pidatonya komprehensif dan memberi dasar filosofis (philosophische grondslag) yang mengikat berbagai gagasan",
      "pidatonya menekankan aspek ekonomi semata",
      "pidatonya ditulis oleh Panitia Sembilan",
      "pidatonya menolak proses musyawarah"
    ],
    "answer": 1
  },
  {
    "q": "Jika tujuan Panitia 8 adalah merangkum usulan-usulan anggota BPUPK, konsekuensi langsung pembentukan panitia ini terhadap proses perumusan dasar negara adalah...",
    "choices": [
      "Mempercepat proses karena mengumpulkan usulan tertulis menjadi satu naskah terpadu",
      "Membuat proses menjadi sangat rahasia sehingga mengurangi legitimasi",
      "Menghapus semua perbedaan pendapat",
      "Mengubah bentuk negara menjadi federal",
      "Membatalkan pidato Soekarno"
    ],
    "answer": 0
  },
  {
    "q": "Perdebatan mengenai rumusan Piagam Jakarta (yang memasukkan frasa kewajiban syariat Islam bagi pemeluknya) paling jelas menunjukkan konflik antara...",
    "choices": [
      "kebutuhan persatuan nasional dan tuntutan kelompok agama untuk pengakuan khusus",
      "keinginan Jepang dan tuntutan Belanda",
      "militer dan sipil",
      "kaum muda dan tua",
      "pendukung monarki dan republik"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa frasa 'Ketuhanan dengan kewajiban menjalankan syariat Islam bagi pemeluk-pemeluknya' akhirnya dihapus dari rumusan akhir Pancasila?",
    "choices": [
      "Karena mayoritas anggota PPKI menolak agama dalam negara sama sekali",
      "Untuk menghindari penolakan dari wilayah non-Muslim dan menjaga persatuan bangsa yang majemuk",
      "Karena frasa itu dinilai tidak Islami oleh ulama",
      "Karena Jepang memerintahkan penghapusan",
      "Karena Soekarno meminta frasa agama dihapus"
    ],
    "answer": 1
  },
  {
    "q": "Bandingkan gagasan Soepomo tentang negara integralistik dengan konsep federal. Pernyataan mana yang paling tepat?",
    "choices": [
      "Integralistik menekankan kesatuan negara dan kepentingan bersama, berbeda dengan federal yang memberi otonomi daerah",
      "Integralistik sama persis dengan federal",
      "Integralistik menuntut pembagian kekuasaan ke wilayah secara luas",
      "Integralistik mendukung sistem monarki terpusat",
      "Integralistik menolak prinsip musyawarah"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa pemilihan istilah 'Pancasila' (bukan 'Panca Dharma' atau istilah lain) penting dalam upaya legitimasi dasar negara?",
    "choices": [
      "Karena istilah yang ringkas dan mudah diingat mempermudah komunikasi dan penerimaan publik luas",
      "Karena istilah itu berasal dari Jepang",
      "Karena istilah itu mengandung makna hukum internasional yang kuat",
      "Karena istilah itu diberikan oleh Soepomo saja",
      "Karena istilah itu menghapus unsur agama"
    ],
    "answer": 0
  },
  {
    "q": "Apa fungsi Panitia Sembilan (Panitia 9) dalam kaitannya dengan Panitia 8 saat perumusan Pembukaan UUD?",
    "choices": [
      "Menuliskan dan memperdebatkan rumusan pembukaan UUD berdasarkan pidato Soekarno sehingga mempersempit dan memperjelas redaksi",
      "Menghapus semua hasil Panitia 8",
      "Menunjuk presiden dan wakil presiden secara langsung",
      "Mengelola logistik sidang BPUPK",
      "Menjaga keamanan sidang"
    ],
    "answer": 0
  },
  {
    "q": "Bagaimana komposisi BPUPK (birokrat, ulama, nasionalis, independen, perwakilan Jepang) mempengaruhi hasil diskusi?",
    "choices": [
      "Memaksa konsensus yang mengakomodasi berbagai kepentingan sehingga melahirkan rumusan yang moderat dan inklusif",
      "Membuat proses bebas dari konflik sama sekali",
      "Menghasilkan keputusan yang sepenuhnya berpihak pada Jepang",
      "Menghasilkan dokumen yang hanya mengakomodasi tuntutan ulama",
      "Menyebabkan kegagalan sidang tanpa hasil"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa sidang BPUPK pertama (29 Mei–1 Juni 1945) dianggap krusial dalam kelahiran Pancasila?",
    "choices": [
      "Karena di sana muncul gagasan dasar negara yang menjadi bahan utama perumusan Pancasila dan Pembukaan UUD",
      "Karena di sana Indonesia memproklamasikan kemerdekaan",
      "Karena di sana Jepang menyerah secara resmi",
      "Karena di sana dibentuk PPKI",
      "Karena di sana dibahas masalah ekonomi semata"
    ],
    "answer": 0
  },
  {
    "q": "Analisis retorika: Metode Soekarno yang paling memengaruhi pendengar pada pidato 1 Juni 1945 adalah...",
    "choices": [
      "penggunaan argumen filosofis (philosophische grondslag) yang mengaitkan nilai moral, politik, dan kebangsaan",
      "penggunaan humor ringan sepanjang pidato",
      "penyajian data statistik ekonomi yang kompleks",
      "penggunaan bahasa Jepang dalam pengantar",
      "pembacaan teks panjang tanpa improvisasi"
    ],
    "answer": 0
  },
  {
    "q": "Jika tujuan PPKI adalah menyiapkan kemerdekaan operasional negara, tindakan paling mendesak yang diambil PPKI pada 18 Agustus 1945 adalah...",
    "choices": [
      "mengesahkan UUD 1945 dan memilih Presiden serta Wakil Presiden agar pemerintahan bisa segera berjalan",
      "mengadakan referendum nasional tentang bentuk negara",
      "menandatangani perjanjian komersial dengan Belanda",
      "membubarkan semua panitia perumus",
      "membentuk dewan penasihat dari pihak Jepang"
    ],
    "answer": 0
  },
  {
    "q": "Perubahan rumusan sila pertama dari Piagam Jakarta ke rumusan akhir Pancasila paling menunjukkan prioritas apa?",
    "choices": [
      "menjaga persatuan nasional di atas tuntutan eksklusif kelompok tertentu",
      "menghilangkan agama dari semua aspek kehidupan",
      "memenuhi tuntutan Jepang untuk netralitas agama",
      "menguatkan pengaruh Soepomo di sidang",
      "menjaga kepentingan satu golongan etnis"
    ],
    "answer": 0
  },
  {
    "q": "Proses musyawarah (deliberation) nampak paling jelas melalui tindakan apa dalam perumusan Pancasila?",
    "choices": [
      "diskusi di BPUPK, pembentukan panitia kecil (8 dan 9), dan mufakat di PPKI",
      "pengumuman sepihak oleh Jepang tanpa diskusi",
      "pemungutan suara langsung oleh seluruh rakyat saat itu",
      "keputusan oleh satu tokoh tanpa debat",
      "penggunaan diktat militer untuk menentukan rumusan"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia Sembilan memilih bertemu di rumah Soekarno untuk merumuskan pembukaan UUD?",
    "choices": [
      "agar bisa membahas secara intensif, cepat, dan dalam suasana kondusif sehingga menghasilkan draf siap-saji untuk sidang",
      "karena gedung resmi sedang ditutup oleh Jepang",
      "agar Soekarno dapat memonopoli proses perumusan",
      "atas perintah langsung dari Jepang",
      "karena ingin mengundang pers internasional"
    ],
    "answer": 0
  },
  {
    "q": "Jika frasa syariat Islam dipertahankan dalam rumusan akhir, konsekuensi konstitusional jangka panjang yang paling mungkin terjadi adalah...",
    "choices": [
      "munculnya tuntutan implementasi hukum agama di area tertentu yang berpotensi mengecualikan kelompok non-Muslim",
      "penghapusan semua agama selain Islam di seluruh negeri",
      "transformasi Indonesia menjadi negara federal otomatis",
      "pemecahan masalah ekonomi dan sosial secara langsung",
      "penguatan kembali kekuasaan kolonial Belanda"
    ],
    "answer": 0
  },
  {
    "q": "Keputusan PPKI tanggal 19 Agustus 1945 (pembentukan kementerian dan pembagian wilayah) menandakan prioritas apa dalam pembangunan negara baru?",
    "choices": [
      "mendesak operasionalisasi pemerintahan agar negara dapat berfungsi efektif segera setelah proklamasi",
      "memprioritaskan pembentukan partai politik baru",
      "memfokuskan pada reformasi pendidikan sebelum pembentukan kabinet",
      "membangun hubungan luar negeri sebelum pemerintahan dalam negeri",
      "menunda pembentukan pemerintahan sampai perundingan internasional selesai"
    ],
    "answer": 0
  },
  {
    "q": "Manakah yang paling menggambarkan hubungan antara perumusan Pancasila dan kebutuhan legitimasi internasional?",
    "choices": [
      "Perumusan Pancasila lebih didorong oleh kebutuhan legitimasi internal untuk menyatukan bangsa daripada untuk mendapatkan pengakuan internasional",
      "Perumusan Pancasila terutama bertujuan memperoleh izin dari Jepang",
      "Perumusan Pancasila disusun untuk mengejar pengakuan PBB secepatnya",
      "Perumusan Pancasila ditujukan untuk menarik investasi asing besar",
      "Perumusan Pancasila dibuat karena tekanan asing dari sekutu"
    ],
    "answer": 0
  },
  {
    "q": "Peran Panitia 8 dalam menampung usulan tertulis dari anggota BPUPK paling relevan untuk apa?",
    "choices": [
      "mencatat ragam gagasan sehingga rumusan akhir dapat lebih inklusif dan representatif",
      "mengurangi keberagaman pendapat demi konsistensi Jepang",
      "mempromosikan gagasan satu tokoh tertentu saja",
      "menggagalkan pidato Soekarno agar tidak berpengaruh",
      "mengubah hasil sidang menjadi dokumen rahasia saja"
    ],
    "answer": 0
  },
  {
    "q": "Dari sudut tata negara, mengapa pilihan istilah 'permusyawaratan/perwakilan' penting dalam sila ke-4?",
    "choices": [
      "Karena menegaskan metode pengambilan keputusan berbasis konsultasi dan perwakilan, bukan dominasi satu pihak",
      "Karena menetapkan bentuk ekonomi negara",
      "Karena menghapus kewenangan legislatif",
      "Karena menyatakan bentuk monarki pemerintahan",
      "Karena menghilangkan hak asasi"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa gagasan Yamin tentang 'Piagam Jakarta' tetap berpengaruh meskipun rumusannya diubah?",
    "choices": [
      "Karena Piagam Jakarta merepresentasikan upaya serius mengakomodasi aspirasi umat Islam sekaligus merupakan langkah awal merumuskan pembukaan UUD",
      "Karena Piagam Jakarta ditentukan oleh Jepang",
      "Karena Piagam Jakarta langsung menjadi konstitusi final tanpa perubahan",
      "Karena Piagam Jakarta menghapus Pancasila",
      "Karena Piagam Jakarta ditolak sepenuhnya oleh peserta sidang"
    ],
    "answer": 0
  },
  {
    "q": "Jika melihat proses perumusan Pancasila, unsur apa yang paling memperkuat legitimasi nasional akhir?",
    "choices": [
      "mekanisme musyawarah yang melibatkan berbagai kelompok (BPUPK, panitia kecil, PPKI) dan konsensus mufakat",
      "intervensi militer asing",
      "keputusan sepihak satu tokoh",
      "referendum internasional yang mengonfirmasi rumusan",
      "diktat dari kekuatan kolonial"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa penetapan Soekarno–Hatta sebagai Presiden dan Wakil Presiden oleh PPKI dianggap langkah strategis?",
    "choices": [
      "karena pasangan itu memiliki legitimasi nasional luas dan mampu menyatukan berbagai golongan politik untuk memimpin negara baru",
      "karena mereka dipilih langsung oleh pihak Jepang",
      "karena mereka berasal dari angkatan bersenjata mayoritas",
      "karena mereka merupakan perwakilan satu agama saja",
      "karena mereka menolak pembentukan kementerian"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia Sembilan memasukkan frasa kewajiban syariat Islam dalam rumusan awal?",
    "choices": [
      "untuk meredakan tuntutan kelompok Islam yang kuat dan mencapai kompromi politik demi kemajuan perumusan pembukaan",
      "untuk menjadikan Indonesia negara Islam secara eksplisit",
      "atas perintah Jepang untuk mengutamakan agama tertentu",
      "untuk membatasi hak perwakilan daerah timur",
      "karena frasa itu diusulkan oleh kekuatan luar negeri"
    ],
    "answer": 0
  },
  {
    "q": "Jika mengevaluasi proses dari BPUPK sampai PPKI, kelemahan nyata yang harus diakui adalah...",
    "choices": [
      "perdebatan dasar negara sempat memperlihatkan ketegangan yang jika tak dikelola bisa memecah persatuan sehingga kebutuhan kompromi menjadi krusial",
      "prosesnya terlalu panjang tanpa hasil nyata",
      "proses sepenuhnya dikendalikan asing tanpa partisipasi penduduk",
      "tidak ada upaya menghasilkan rumusan dasar negara",
      "semua keputusan dibuat oleh PBB"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa istilah 'Ketuhanan Yang Maha Esa' pada akhirnya lebih dianggap inklusif daripada rumusan Piagam Jakarta?",
    "choices": [
      "karena istilah itu netral dan dapat diterima oleh pemeluk berbagai agama sehingga mengurangi potensi eksklusi",
      "karena istilah itu merepresentasikan satu agama tertentu saja",
      "karena istilah itu dipaksakan Jepang",
      "karena istilah itu menghapus seluruh agama lokal",
      "karena istilah itu mengadopsi sistem hukum Barat"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia 8 dan Panitia Sembilan dianggap efektif dalam proses perumusan Pancasila?",
    "choices": [
      "karena keduanya memisahkan tugas pengumpulan usulan dan perumusan sehingga proses menjadi lebih terstruktur dan cepat",
      "karena keduanya menutup proses dari publik sepenuhnya",
      "karena keduanya diberi wewenang penuh oleh Jepang tanpa diskusi",
      "karena keduanya menunda proklamasi kemerdekaan",
      "karena keduanya menganjurkan negara federal"
    ],
    "answer": 0
  },
  {
    "q": "Keputusan PPKI mengesahkan UUD 1945 pada 18 Agustus 1945 mengimplikasikan apa secara langsung?",
    "choices": [
      "terbentuknya kerangka hukum yang memungkinkan pembentukan pemerintahan serta kementerian secara cepat",
      "berlangsungnya pengembalian kekuasaan ke Belanda",
      "pembentukan pemerintahan Jepang di Indonesia",
      "pengubahan bentuk negara menjadi federal secara otomatis",
      "pengangkatan raja sebagai kepala negara"
    ],
    "answer": 0
  },
  {
    "q": "Tarik ulur tuntutan agama dan kebutuhan negara pada masa perumusan lebih tepat digambarkan sebagai...",
    "choices": [
      "tuntutan agama diakomodasi pada tahap awal tetapi disesuaikan kemudian demi menjaga persatuan nasional yang lebih luas",
      "tuntutan agama menang sepenuhnya tanpa kompromi",
      "negara sepenuhnya menolak tuntutan agama dari awal",
      "tuntutan agama tidak pernah muncul dalam pembahasan",
      "tuntutan agama dipaksakan oleh kekuatan asing"
    ],
    "answer": 0
  },
  {
    "q": "Pembelajaran utama dari proses perumusan dasar negara yang relevan untuk demokrasi kontemporer adalah...",
    "choices": [
      "pentingnya mekanisme deliberasi inklusif dan kemampuan kompromi untuk menghasilkan legitimasi luas dalam masyarakat majemuk",
      "bahwa keputusan tunggal selalu lebih efektif daripada musyawarah",
      "bahwa agama harus sepenuhnya dihapus dari ruang publik untuk menjamin persatuan",
      "bahwa kekuatan militer adalah perantara terbaik dalam perumusan konstitusi",
      "bahwa hanya elit berhak menentukan dasar negara"
    ],
    "answer": 0
  }
    ]
