[ { "q": "Mengapa Jepang membentuk BPUPK (Dokuritsu Zyunbi Tyoosakai) pada 29 April 1945?", "choices": [ "Untuk mencari dukungan rakyat Indonesia sambil mengendalikan proses persiapan kemerdekaan", "Untuk memberi kemerdekaan penuh tanpa syarat secepatnya", "Untuk melatih birokrasi sipil Indonesia agar siap setelah Jepang kalah", "Untuk menyiapkan Indonesia menjadi negara boneka dalam lingkup Asia Timur Raya", "Untuk membatasi gerakan nasionalis agar tetap terkendali" ], "answer": 0 }, { "q": "Mengapa gagasan Soekarno tentang Pancasila diterima secara luas di sidang BPUPK?", "choices": [ "Karena pidatonya komprehensif dan menawarkan dasar filosofis (philosophische grondslag) yang mempersatukan", "Karena ia adalah ketua BPUPK yang berwenang mengesahkan langsung", "Karena pidatonya hanya menekankan aspek ekonomi yang disetujui semua pihak", "Karena usulannya sama persis dengan Piagam Jakarta tanpa perubahan", "Karena pidatonya paling singkat sehingga cepat disetujui" ], "answer": 0 }, { "q": "Perdebatan mengenai rumusan Piagam Jakarta paling jelas menunjukkan konflik antara...", "choices": [ "kepentingan persatuan nasional dan aspirasi kelompok agama untuk pengakuan khusus", "keinginan Jepang mempertahankan kekuasaan dan tuntutan rakyat untuk merdeka", "kelompok sipil yang moderat dengan kelompok militer radikal", "kaum muda yang revolusioner dengan kaum tua yang konservatif", "pendukung bentuk negara republik dengan pendukung bentuk negara monarki" ], "answer": 0 }, { "q": "Mengapa frasa 'Ketuhanan dengan kewajiban menjalankan syariat Islam bagi pemeluknya' akhirnya dihapus dari rumusan akhir Pancasila?", "choices": [ "Untuk menghindari penolakan dari wilayah non-Muslim dan menjaga persatuan bangsa", "Karena mayoritas anggota PPKI menolak agama dalam negara sama sekali", "Karena Soekarno meminta agar agama tidak disebut dalam dasar negara", "Karena Jepang secara langsung melarang pencantuman agama dalam konstitusi", "Karena dianggap sudah tercakup dalam UUD tanpa perlu dicantumkan di Pancasila" ], "answer": 0 }, { "q": "Konsep negara integralistik ala Soepomo berbeda dengan konsep federal karena...", "choices": [ "negara integralistik menekankan kesatuan tanpa memberi otonomi luas pada daerah", "negara integralistik menghapuskan pemerintahan pusat dan memberi kekuasaan ke daerah", "negara integralistik sama persis dengan sistem federal tetapi memakai istilah berbeda", "negara integralistik hanya berfokus pada hubungan luar negeri", "negara integralistik menolak adanya konstitusi tertulis" ], "answer": 0 }, { "q": "Pemilihan istilah 'Pancasila' oleh Soekarno penting karena...", "choices": [ "istilah ini ringkas, mudah diingat, dan dapat diterima lintas golongan", "istilah ini berasal dari bahasa Jepang yang netral", "istilah ini diambil dari hukum internasional agar diakui PBB", "istilah ini ditetapkan Jepang agar tidak menyinggung pihak manapun", "istilah ini lebih populer dibanding 'Undang-Undang Dasar'" ], "answer": 0 }, { "q": "Apa peran Panitia Sembilan dalam proses perumusan dasar negara?", "choices": [ "merumuskan Piagam Jakarta yang menjadi dasar Pembukaan UUD 1945", "menggantikan BPUPK sebagai lembaga tertinggi", "menentukan presiden dan wakil presiden tanpa sidang lanjutan", "membubarkan Panitia Delapan dan mengambil alih tugasnya", "mengatur strategi militer menghadapi sekutu" ], "answer": 0 }, { "q": "Sidang BPUPK pertama (29 Mei–1 Juni 1945) dianggap krusial karena...", "choices": [ "di dalamnya muncul gagasan dasar negara yang jadi bahan utama Pancasila", "di dalamnya diputuskan proklamasi kemerdekaan secara langsung", "di dalamnya Jepang menyerah kepada sekutu", "di dalamnya ditentukan Soekarno sebagai presiden pertama", "di dalamnya ditandatangani perjanjian internasional dengan Belanda" ], "answer": 0 }, { "q": "Jika frasa syariat Islam dipertahankan, dampak jangka panjang yang mungkin terjadi adalah...", "choices": [ "potensi eksklusi kelompok non-Muslim sehingga persatuan bangsa terancam", "penerapan hukum agama secara universal untuk semua warga negara", "penghapusan semua agama lokal yang tidak diakui", "otomatis menjadikan Indonesia sebagai negara federal", "mencegah lahirnya konflik politik di masa depan" ], "answer": 0 }, { "q": "Keputusan PPKI tanggal 18 Agustus 1945 menunjukkan prioritas...", "choices": [ "mengesahkan UUD 1945 dan menetapkan presiden agar pemerintahan segera berjalan", "menunda pembentukan pemerintahan demi menunggu pengakuan internasional", "menetapkan RIS sebagai bentuk negara awal", "membentuk parlemen federal untuk daerah-daerah", "menyerahkan pemerintahan sementara ke Jepang" ], "answer": 0 }, { "q": "Apa prioritas PPKI pada sidang 19 Agustus 1945?", "choices": [ "membentuk kementerian dan membagi wilayah RI agar pemerintahan fungsional", "mengesahkan perubahan dasar negara dari Pancasila ke Piagam Jakarta", "menunda pembentukan pemerintahan hingga ekonomi stabil", "mengesahkan referendum untuk memilih kepala negara", "membubarkan semua panitia dan membentuk dewan militer" ], "answer": 0 }, { "q": "Apa makna keputusan PPKI pada 22 Agustus 1945 membentuk KNI, PNI, dan BKR?", "choices": [ "upaya memperkuat legitimasi pemerintahan dan menyiapkan elemen politik serta keamanan", "langkah untuk menunda pembentukan lembaga eksekutif", "keputusan untuk membatasi partisipasi rakyat dalam politik", "penolakan terhadap pembentukan tentara nasional", "bentuk tekanan Jepang agar tetap berkuasa" ], "answer": 0 }, { "q": "Mengapa istilah 'Ketuhanan Yang Maha Esa' lebih inklusif dibanding rumusan Piagam Jakarta?", "choices": [ "karena istilah itu dapat diterima semua agama di Indonesia", "karena istilah itu meniadakan peran agama sepenuhnya", "karena istilah itu diminta Jepang demi netralitas", "karena istilah itu hanya menekankan satu agama", "karena istilah itu identik dengan hukum Barat" ], "answer": 0 }, { "q": "Mengapa PPKI menetapkan Soekarno-Hatta sebagai Presiden dan Wakil Presiden?", "choices": [ "karena keduanya memiliki legitimasi nasional dan diterima berbagai golongan", "karena mereka dipilih langsung oleh Jepang dalam perjanjian resmi", "karena keduanya berasal dari latar belakang militer", "karena keduanya mewakili kelompok agama tunggal", "karena mereka satu-satunya anggota BPUPK" ], "answer": 0 } ]

    ],
    "answer": 0
  },
  {
    "q": "Analisis retorika: Metode Soekarno yang paling memengaruhi pendengar pada pidato 1 Juni 1945 adalah...",
    "choices": [
      "penggunaan argumen filosofis (philosophische grondslag) yang mengaitkan nilai moral, politik, dan kebangsaan",
      "penggunaan humor ringan sepanjang pidato",
      "penyajian data statistik ekonomi yang kompleks",
      "penggunaan bahasa Jepang dalam pengantar",
      "pembacaan teks panjang tanpa improvisasi"
    ],
    "answer": 0
  },
  {
    "q": "Jika tujuan PPKI adalah menyiapkan kemerdekaan operasional negara, tindakan paling mendesak yang diambil PPKI pada 18 Agustus 1945 adalah...",
    "choices": [
      "mengesahkan UUD 1945 dan memilih Presiden serta Wakil Presiden agar pemerintahan bisa segera berjalan",
      "mengadakan referendum nasional tentang bentuk negara",
      "menandatangani perjanjian komersial dengan Belanda",
      "membubarkan semua panitia perumus",
      "membentuk dewan penasihat dari pihak Jepang"
    ],
    "answer": 0
  },
  {
    "q": "Perubahan rumusan sila pertama dari Piagam Jakarta ke rumusan akhir Pancasila paling menunjukkan prioritas apa?",
    "choices": [
      "menjaga persatuan nasional di atas tuntutan eksklusif kelompok tertentu",
      "menghilangkan agama dari semua aspek kehidupan",
      "memenuhi tuntutan Jepang untuk netralitas agama",
      "menguatkan pengaruh Soepomo di sidang",
      "menjaga kepentingan satu golongan etnis"
    ],
    "answer": 0
  },
  {
    "q": "Proses musyawarah (deliberation) nampak paling jelas melalui tindakan apa dalam perumusan Pancasila?",
    "choices": [
      "diskusi di BPUPK, pembentukan panitia kecil (8 dan 9), dan mufakat di PPKI",
      "pengumuman sepihak oleh Jepang tanpa diskusi",
      "pemungutan suara langsung oleh seluruh rakyat saat itu",
      "keputusan oleh satu tokoh tanpa debat",
      "penggunaan diktat militer untuk menentukan rumusan"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia Sembilan memilih bertemu di rumah Soekarno untuk merumuskan pembukaan UUD?",
    "choices": [
      "agar bisa membahas secara intensif, cepat, dan dalam suasana kondusif sehingga menghasilkan draf siap-saji untuk sidang",
      "karena gedung resmi sedang ditutup oleh Jepang",
      "agar Soekarno dapat memonopoli proses perumusan",
      "atas perintah langsung dari Jepang",
      "karena ingin mengundang pers internasional"
    ],
    "answer": 0
  },
  {
    "q": "Jika frasa syariat Islam dipertahankan dalam rumusan akhir, konsekuensi konstitusional jangka panjang yang paling mungkin terjadi adalah...",
    "choices": [
      "munculnya tuntutan implementasi hukum agama di area tertentu yang berpotensi mengecualikan kelompok non-Muslim",
      "penghapusan semua agama selain Islam di seluruh negeri",
      "transformasi Indonesia menjadi negara federal otomatis",
      "pemecahan masalah ekonomi dan sosial secara langsung",
      "penguatan kembali kekuasaan kolonial Belanda"
    ],
    "answer": 0
  },
  {
    "q": "Keputusan PPKI tanggal 19 Agustus 1945 (pembentukan kementerian dan pembagian wilayah) menandakan prioritas apa dalam pembangunan negara baru?",
    "choices": [
      "mendesak operasionalisasi pemerintahan agar negara dapat berfungsi efektif segera setelah proklamasi",
      "memprioritaskan pembentukan partai politik baru",
      "memfokuskan pada reformasi pendidikan sebelum pembentukan kabinet",
      "membangun hubungan luar negeri sebelum pemerintahan dalam negeri",
      "menunda pembentukan pemerintahan sampai perundingan internasional selesai"
    ],
    "answer": 0
  },
  {
    "q": "Manakah yang paling menggambarkan hubungan antara perumusan Pancasila dan kebutuhan legitimasi internasional?",
    "choices": [
      "Perumusan Pancasila lebih didorong oleh kebutuhan legitimasi internal untuk menyatukan bangsa daripada untuk mendapatkan pengakuan internasional",
      "Perumusan Pancasila terutama bertujuan memperoleh izin dari Jepang",
      "Perumusan Pancasila disusun untuk mengejar pengakuan PBB secepatnya",
      "Perumusan Pancasila ditujukan untuk menarik investasi asing besar",
      "Perumusan Pancasila dibuat karena tekanan asing dari sekutu"
    ],
    "answer": 0
  },
  {
    "q": "Peran Panitia 8 dalam menampung usulan tertulis dari anggota BPUPK paling relevan untuk apa?",
    "choices": [
      "mencatat ragam gagasan sehingga rumusan akhir dapat lebih inklusif dan representatif",
      "mengurangi keberagaman pendapat demi konsistensi Jepang",
      "mempromosikan gagasan satu tokoh tertentu saja",
      "menggagalkan pidato Soekarno agar tidak berpengaruh",
      "mengubah hasil sidang menjadi dokumen rahasia saja"
    ],
    "answer": 0
  },
  {
    "q": "Dari sudut tata negara, mengapa pilihan istilah 'permusyawaratan/perwakilan' penting dalam sila ke-4?",
    "choices": [
      "Karena menegaskan metode pengambilan keputusan berbasis konsultasi dan perwakilan, bukan dominasi satu pihak",
      "Karena menetapkan bentuk ekonomi negara",
      "Karena menghapus kewenangan legislatif",
      "Karena menyatakan bentuk monarki pemerintahan",
      "Karena menghilangkan hak asasi"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa gagasan Yamin tentang 'Piagam Jakarta' tetap berpengaruh meskipun rumusannya diubah?",
    "choices": [
      "Karena Piagam Jakarta merepresentasikan upaya serius mengakomodasi aspirasi umat Islam sekaligus merupakan langkah awal merumuskan pembukaan UUD",
      "Karena Piagam Jakarta ditentukan oleh Jepang",
      "Karena Piagam Jakarta langsung menjadi konstitusi final tanpa perubahan",
      "Karena Piagam Jakarta menghapus Pancasila",
      "Karena Piagam Jakarta ditolak sepenuhnya oleh peserta sidang"
    ],
    "answer": 0
  },
  {
    "q": "Jika melihat proses perumusan Pancasila, unsur apa yang paling memperkuat legitimasi nasional akhir?",
    "choices": [
      "mekanisme musyawarah yang melibatkan berbagai kelompok (BPUPK, panitia kecil, PPKI) dan konsensus mufakat",
      "intervensi militer asing",
      "keputusan sepihak satu tokoh",
      "referendum internasional yang mengonfirmasi rumusan",
      "diktat dari kekuatan kolonial"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa penetapan Soekarno–Hatta sebagai Presiden dan Wakil Presiden oleh PPKI dianggap langkah strategis?",
    "choices": [
      "karena pasangan itu memiliki legitimasi nasional luas dan mampu menyatukan berbagai golongan politik untuk memimpin negara baru",
      "karena mereka dipilih langsung oleh pihak Jepang",
      "karena mereka berasal dari angkatan bersenjata mayoritas",
      "karena mereka merupakan perwakilan satu agama saja",
      "karena mereka menolak pembentukan kementerian"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia Sembilan memasukkan frasa kewajiban syariat Islam dalam rumusan awal?",
    "choices": [
      "untuk meredakan tuntutan kelompok Islam yang kuat dan mencapai kompromi politik demi kemajuan perumusan pembukaan",
      "untuk menjadikan Indonesia negara Islam secara eksplisit",
      "atas perintah Jepang untuk mengutamakan agama tertentu",
      "untuk membatasi hak perwakilan daerah timur",
      "karena frasa itu diusulkan oleh kekuatan luar negeri"
    ],
    "answer": 0
  },
  {
    "q": "Jika mengevaluasi proses dari BPUPK sampai PPKI, kelemahan nyata yang harus diakui adalah...",
    "choices": [
      "perdebatan dasar negara sempat memperlihatkan ketegangan yang jika tak dikelola bisa memecah persatuan sehingga kebutuhan kompromi menjadi krusial",
      "prosesnya terlalu panjang tanpa hasil nyata",
      "proses sepenuhnya dikendalikan asing tanpa partisipasi penduduk",
      "tidak ada upaya menghasilkan rumusan dasar negara",
      "semua keputusan dibuat oleh PBB"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa istilah 'Ketuhanan Yang Maha Esa' pada akhirnya lebih dianggap inklusif daripada rumusan Piagam Jakarta?",
    "choices": [
      "karena istilah itu netral dan dapat diterima oleh pemeluk berbagai agama sehingga mengurangi potensi eksklusi",
      "karena istilah itu merepresentasikan satu agama tertentu saja",
      "karena istilah itu dipaksakan Jepang",
      "karena istilah itu menghapus seluruh agama lokal",
      "karena istilah itu mengadopsi sistem hukum Barat"
    ],
    "answer": 0
  },
  {
    "q": "Mengapa Panitia 8 dan Panitia Sembilan dianggap efektif dalam proses perumusan Pancasila?",
    "choices": [
      "karena keduanya memisahkan tugas pengumpulan usulan dan perumusan sehingga proses menjadi lebih terstruktur dan cepat",
      "karena keduanya menutup proses dari publik sepenuhnya",
      "karena keduanya diberi wewenang penuh oleh Jepang tanpa diskusi",
      "karena keduanya menunda proklamasi kemerdekaan",
      "karena keduanya menganjurkan negara federal"
    ],
    "answer": 0
  },
  {
    "q": "Keputusan PPKI mengesahkan UUD 1945 pada 18 Agustus 1945 mengimplikasikan apa secara langsung?",
    "choices": [
      "terbentuknya kerangka hukum yang memungkinkan pembentukan pemerintahan serta kementerian secara cepat",
      "berlangsungnya pengembalian kekuasaan ke Belanda",
      "pembentukan pemerintahan Jepang di Indonesia",
      "pengubahan bentuk negara menjadi federal secara otomatis",
      "pengangkatan raja sebagai kepala negara"
    ],
    "answer": 0
  },
  {
    "q": "Tarik ulur tuntutan agama dan kebutuhan negara pada masa perumusan lebih tepat digambarkan sebagai...",
    "choices": [
      "tuntutan agama diakomodasi pada tahap awal tetapi disesuaikan kemudian demi menjaga persatuan nasional yang lebih luas",
      "tuntutan agama menang sepenuhnya tanpa kompromi",
      "negara sepenuhnya menolak tuntutan agama dari awal",
      "tuntutan agama tidak pernah muncul dalam pembahasan",
      "tuntutan agama dipaksakan oleh kekuatan asing"
    ],
    "answer": 0
  },
  {
    "q": "Pembelajaran utama dari proses perumusan dasar negara yang relevan untuk demokrasi kontemporer adalah...",
    "choices": [
      "pentingnya mekanisme deliberasi inklusif dan kemampuan kompromi untuk menghasilkan legitimasi luas dalam masyarakat majemuk",
      "bahwa keputusan tunggal selalu lebih efektif daripada musyawarah",
      "bahwa agama harus sepenuhnya dihapus dari ruang publik untuk menjamin persatuan",
      "bahwa kekuatan militer adalah perantara terbaik dalam perumusan konstitusi",
      "bahwa hanya elit berhak menentukan dasar negara"
    ],
    "answer": 0
  }
    ]
