[ { "q": "Mengapa Jepang membentuk BPUPK (Dokuritsu Zyunbi Tyoosakai) pada 29 April 1945?", "choices": [ "Untuk mencari dukungan rakyat Indonesia sambil mengendalikan proses kemerdekaan", "Untuk memberi kemerdekaan penuh tanpa syarat secepatnya", "Untuk melatih birokrasi sipil Indonesia setelah Jepang kalah", "Untuk menjadikan Indonesia negara boneka dalam lingkup Asia Timur Raya", "Untuk membatasi gerakan nasionalis agar tidak berkembang" ], "answer": 0 }, { "q": "Mengapa gagasan Soekarno tentang Pancasila diterima secara luas di sidang BPUPK?", "choices": [ "Karena pidatonya komprehensif dengan dasar filosofis yang mempersatukan", "Karena ia adalah ketua sidang sehingga otomatis disahkan", "Karena gagasannya identik dengan Piagam Jakarta", "Karena hanya menekankan aspek ekonomi yang disetujui semua pihak", "Karena pidatonya paling singkat dan praktis" ], "answer": 0 }, { "q": "Perdebatan mengenai Piagam Jakarta terutama mencerminkan konflik antara...", "choices": [ "persatuan nasional dan aspirasi kelompok agama untuk pengakuan khusus", "keinginan Jepang mempertahankan kekuasaan dan tuntutan kemerdekaan", "kaum muda yang radikal dengan kaum tua yang konservatif", "pendukung republik dengan pendukung monarki", "golongan pedagang dengan golongan petani" ], "answer": 0 }, { "q": "Mengapa frasa 'Ketuhanan dengan kewajiban menjalankan syariat Islam bagi pemeluknya' dihapus dari rumusan akhir Pancasila?", "choices": [ "Untuk menjaga persatuan bangsa yang majemuk agar semua agama diterima", "Karena Jepang melarang pencantuman agama dalam konstitusi", "Karena mayoritas anggota menolak agama dalam negara", "Karena Soekarno menolak penyebutan agama dalam dasar negara", "Karena dianggap cukup diatur dalam undang-undang biasa" ], "answer": 0 }, { "q": "Mengapa konsep negara integralistik Soepomo dianggap berbeda dari federalisme?", "choices": [ "Karena menekankan kesatuan tanpa memberi otonomi luas pada daerah", "Karena menghapus pemerintahan pusat dan menyerahkan kekuasaan ke daerah", "Karena identik dengan federalisme tetapi berbeda nama", "Karena hanya berfokus pada hubungan internasional", "Karena menolak konstitusi tertulis secara penuh" ], "answer": 0 }, { "q": "Mengapa istilah 'Pancasila' penting dalam rumusan dasar negara?", "choices": [ "Karena ringkas, mudah diingat, dan diterima lintas golongan", "Karena berasal dari bahasa Jepang yang netral", "Karena diambil dari hukum internasional agar diakui PBB", "Karena ditetapkan Jepang agar tidak menyinggung pihak manapun", "Karena lebih populer dibanding istilah Undang-Undang Dasar" ], "answer": 0 }, { "q": "Apa peran Panitia Sembilan dalam proses dasar negara?", "choices": [ "Merumuskan Piagam Jakarta sebagai bahan Pembukaan UUD 1945", "Menggantikan BPUPK sebagai lembaga tertinggi negara", "Menentukan presiden dan wakil presiden tanpa sidang lanjutan", "Membubarkan Panitia Delapan dan mengambil alih tugasnya", "Mengatur strategi militer melawan sekutu" ], "answer": 0 }, { "q": "Mengapa sidang BPUPK pertama dianggap penting?", "choices": [ "Karena memunculkan gagasan dasar negara yang jadi bahan utama Pancasila", "Karena langsung memutuskan proklamasi kemerdekaan", "Karena menandai kekalahan Jepang di Asia Timur", "Karena menetapkan Soekarno sebagai presiden pertama", "Karena menyepakati perjanjian dengan Belanda" ], "answer": 0 }, { "q": "Jika frasa syariat Islam tidak dihapus, kemungkinan dampaknya adalah...", "choices": [ "Potensi eksklusi non-Muslim sehingga persatuan bangsa terganggu", "Semua agama otomatis dihapuskan dari pengakuan resmi", "Penerapan hukum agama universal bagi semua warga negara", "Otomatis menjadikan Indonesia sebagai negara federal", "Mencegah konflik politik di masa depan" ], "answer": 0 }, { "q": "Mengapa PPKI pada 18 Agustus 1945 segera mengesahkan UUD 1945?", "choices": [ "Agar pemerintahan baru segera memiliki dasar hukum yang sah", "Agar menunda pembentukan negara hingga ada pengakuan internasional", "Agar menegaskan bentuk federal sebelum proklamasi", "Agar Jepang tetap memimpin pemerintahan transisi", "Agar memutuskan presiden lewat referendum umum" ], "answer": 0 }, { "q": "Mengapa PPKI menetapkan Soekarno-Hatta sebagai presiden dan wakil presiden?", "choices": [ "Karena keduanya diterima lintas golongan dan punya legitimasi nasional", "Karena dipilih langsung oleh Jepang", "Karena keduanya berasal dari kalangan militer", "Karena hanya mereka berdua yang anggota BPUPK", "Karena keduanya mewakili satu kelompok agama" ], "answer": 0 }, { "q": "Apa makna pembentukan KNI, PNI, dan BKR oleh PPKI?", "choices": [ "Untuk memperkuat legitimasi politik dan menyiapkan unsur keamanan", "Untuk menunda pembentukan lembaga eksekutif", "Untuk membatasi partisipasi rakyat dalam politik", "Untuk menolak pembentukan tentara nasional", "Untuk memenuhi tuntutan Jepang agar tetap berkuasa" ], "answer": 0 }, { "q": "Mengapa istilah 'Ketuhanan Yang Maha Esa' lebih inklusif?", "choices": [ "Karena dapat diterima semua agama di Indonesia", "Karena meniadakan peran agama sepenuhnya", "Karena diminta Jepang demi netralitas", "Karena hanya menekankan satu agama tertentu", "Karena identik dengan hukum Barat" ], "answer": 0 }, { "q": "Mengapa Panitia Delapan dibentuk setelah sidang BPUPK?", "choices": [ "Untuk mengolah usulan anggota dan menyusun laporan sidang", "Untuk menggantikan Panitia Sembilan secara permanen", "Untuk mengesahkan presiden dan wakil presiden", "Untuk menyusun strategi diplomasi luar negeri", "Untuk membubarkan BPUPK sebelum waktunya" ], "answer": 0 }, { "q": "Apa alasan sidang PPKI 19 Agustus membentuk kementerian?", "choices": [ "Agar fungsi pemerintahan berjalan efektif setelah proklamasi", "Agar mempercepat pengakuan internasional sebelum UUD berlaku", "Agar menunda pelaksanaan konstitusi", "Agar membatasi peran presiden sementara", "Agar menunggu persetujuan Jepang terlebih dahulu" ], "answer": 0 }, { "q": "Apa arti penting kompromi Piagam Jakarta bagi bangsa Indonesia?", "choices": [ "Menunjukkan semangat persatuan di atas kepentingan golongan", "Menolak semua bentuk kompromi politik berbasis agama", "Menjadi simbol dominasi satu golongan atas lainnya", "Mengesampingkan peran tokoh Islam dalam sejarah", "Menghapus Pancasila dari dasar negara" ], "answer": 0 }, { "q": "Mengapa Hatta berperan besar dalam perubahan sila pertama Pancasila?", "choices": [ "Karena ia menyampaikan keberatan dari wakil Indonesia Timur", "Karena ia menolak seluruh isi Piagam Jakarta", "Karena ia ketua Panitia Sembilan", "Karena ia menyusun konsep awal UUD 1945 sendirian", "Karena ia presiden pertama Republik Indonesia" ], "answer": 0 }, { "q": "Mengapa dasar internasionalisme penting menurut Soekarno?", "choices": [ "Karena menjamin bangsa Indonesia tetap menghormati nilai kemanusiaan universal", "Karena memastikan Indonesia menjadi negara federasi dunia", "Karena menegaskan dominasi Indonesia atas negara lain", "Karena menghapus batas kedaulatan negara", "Karena hanya berlaku dalam hubungan ekonomi" ], "answer": 0 }, { "q": "Apa tujuan dasar kebangsaan menurut Soekarno?", "choices": [ "Menyatukan rakyat dan tanah air dalam satu identitas nasional", "Menyeragamkan budaya seluruh daerah", "Menjadikan satu agama resmi negara", "Menyatukan hanya aspek ekonomi", "Menghapuskan semua identitas lokal" ], "answer": 0 }, { "q": "Mengapa sidang BPUPK kedua lebih fokus pada UUD?", "choices": [ "Karena setelah dasar negara dirumuskan, perlu landasan konstitusi", "Karena Jepang memaksa agar UUD ditulis untuk kepentingan mereka", "Karena sidang pertama gagal membahas apapun", "Karena hanya membicarakan bentuk negara federal", "Karena hanya membicarakan presiden dan wakil presiden" ], "answer": 0 }, { "q": "Mengapa kompromi antara nasionalis sekuler dan Islam penting?", "choices": [ "Karena tanpa kompromi, proklamasi bisa tertunda akibat perpecahan", "Karena kompromi otomatis menjadikan Indonesia negara sekuler", "Karena kompromi membatalkan seluruh gagasan Pancasila", "Karena kompromi meniadakan agama dalam kehidupan bangsa", "Karena kompromi diminta Jepang agar cepat selesai" ], "answer": 0 }, { "q": "Apa arti penting Panitia Sembilan dalam sejarah perumusan negara?", "choices": [ "Merumuskan dokumen konsensus yang jadi dasar kemerdekaan", "Menghapus Pancasila dari konstitusi", "Menggantikan PPKI dalam fungsi eksekutif", "Menolak semua usulan Soekarno", "Menyusun strategi perang melawan Jepang" ], "answer": 0 }, { "q": "Mengapa kompromi 18 Agustus 1945 dianggap monumental?", "choices": [ "Karena menegaskan semangat persatuan di awal kemerdekaan", "Karena menolak seluruh hasil BPUPK", "Karena menghapus UUD 1945 sementara", "Karena hanya menguntungkan Jepang", "Karena menghapus fungsi presiden" ], "answer": 0 }, { "q": "Apa alasan pentingnya PPKI meski dibentuk Jepang?", "choices": [ "Karena dimanfaatkan tokoh bangsa untuk mengesahkan kemerdekaan", "Karena mewakili kekuasaan mutlak Jepang", "Karena menggantikan peran BPUPK dalam diplomasi luar negeri", "Karena dipakai Belanda untuk menunda proklamasi", "Karena hanya mengurus administrasi militer" ], "answer": 0 }, { "q": "Mengapa proklamasi kemerdekaan dilakukan 17 Agustus 1945?", "choices": [ "Karena situasi kekosongan kekuasaan setelah Jepang menyerah", "Karena Jepang langsung memerintahkan proklamasi", "Karena Belanda memberikan izin resmi", "Karena PBB mendesak Indonesia merdeka", "Karena pasukan sekutu mengatur tanggal tersebut" ], "answer": 0 }, { "q": "Apa arti sidang PPKI sebagai momentum awal pemerintahan RI?", "choices": [ "Mengesahkan struktur dasar negara agar pemerintahan sah", "Menyatakan perang terbuka terhadap Jepang", "Membubarkan semua organisasi politik", "Menunda berlakunya proklamasi", "Menghapus fungsi wakil presiden" ], "answer": 0 }, { "q": "Mengapa kompromi politik awal Indonesia sering disebut politik kebangsaan?", "choices": [ "Karena mendahulukan kepentingan bangsa di atas kelompok", "Karena menolak semua bentuk kompromi", "Karena hanya menguntungkan golongan Islam", "Karena dipaksakan Jepang semata", "Karena menghapus semua dasar agama" ], "answer": 0 }, { "q": "Apa pelajaran utama dari dinamika perumusan Pancasila?", "choices": [ "Bahwa keberagaman dapat dipersatukan lewat kompromi bijak", "Bahwa dasar negara sebaiknya tanpa kompromi", "Bahwa hanya satu kelompok boleh menentukan dasar negara", "Bahwa persatuan hanya mungkin lewat paksaan", "Bahwa proklamasi bisa ditunda tanpa dasar negara" ], "answer": 0 } ]

